package more.ftf;

/**
 * 《星际迷航》的柯克船长来到瓦肯星球，打算开始在瓦肯星球的度假生活。
 *
 * 和地球不一样，瓦肯星球有自己的计数方式，为了能够快速的融入瓦肯星球的生活，柯克船长决定编写一个瓦肯星球的计数转换程序。
 *
 * 瓦肯星球数字包含一下八种字符：^ % & * $ # @ -
 *
 * 柯克船长找史波克要来了一份地球数字和瓦肯星数字的对照表
 *
 * 字符          数值
 *
 * ^             1
 *
 * %             5
 *
 * &             10
 *
 * *             50
 *
 * $             100
 *
 * #             500
 *
 * @             1000
 *
 * -             5000
 *
 * 柯克船长抬头看了一眼日历，瓦肯星日历上现在是
 *
 * 星历“@-$$$&$%^^^年&^^月^&日%^^时&*%^^^分*%^秒”
 *
 * 柯克船长又抬起手腕看了看手表，显示的地球时间是
 *
 * 星历 “4398年12月9日 07时48分56秒”，
 *
 * 下面请写出柯克船长的瓦肯星日历转换程序
 *
 * 输入：Date earthDate
 *
 * 输出：String WatkinsDate
 */
public class F8 {
}
